### 1. Import Dependecies

In [2]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

### 2. Basic Data Processing

In [3]:
df = pd.read_csv('data/raw/Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- Identifires = PassengerId
- Free text-columns = Name,Ticket,Cabin

In [4]:
df = df.drop(columns=['PassengerId','Name','Ticket','Cabin'])
df.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male   NaN      0      0   8.4583        Q
6         0       1    male  54.0      0      0  51.8625        S
7         0       3    male   2.0      3      1  21.0750        S
8         1       3  female  27.0      0      2  11.1333        S
9         1       2  female  14.0      1      0  30.0708        C

In [5]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

### 3. Handling NUll Values

#### 3.1 Imputation

##### 3.2.1 Age

In [6]:
mean = df['Age'].mean()
median = df['Age'].median()
mean = np.round(mean,2)
mean, median

(np.float64(29.7), 28.0)

In [7]:
df.loc[:,'Age'] = df['Age'].fillna(mean)

In [8]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

##### 3.2.2 Embarked

In [9]:
mode = df['Embarked'].mode()[0]
mode

'S'

In [10]:
df.loc[:,'Embarked'] = df['Embarked'].fillna(mode)

In [11]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

### 4.  Encode categorical variables

#### 4.1 One Hot Encoding for norminal variables

In [12]:
norminal_variables=['Sex','Embarked']
sex_dummies = pd.get_dummies(df['Sex'],prefix='Sex').astype(int)
embarked_dummies = pd.get_dummies(df['Embarked'],prefix='Embarked').astype(int)

df = pd.concat([df,sex_dummies],axis=1)
del df['Sex']

df=pd.concat([df,embarked_dummies],axis=1)
del df['Embarked']

df

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,0,1,0,0,1
887,1,1,19.0,0,0,30.0000,1,0,0,0,1
888,0,3,29.7,1,2,23.4500,1,0,0,0,1
889,1,1,26.0,0,0,30.0000,0,1,1,0,0
890,0,3,32.0,0,0,7.7500,0,1,0,1,0

#### 4.2 Label Encoding for Ordinal variables

- since Pclass is already in encode format no need to encode again

### 5. Standardization

In [13]:
scalling_columns = ['Age','SibSp','Parch','Fare']

In [14]:
for col in scalling_columns:
     df[col]= (df[col] - df[col].mean()) / df[col].std()

In [15]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,-0.592162,0.432550,-0.473408,-0.502163,0,1,0,0,1
1,1,1,0.638417,0.432550,-0.473408,0.786404,1,0,1,0,0
2,1,3,-0.284517,-0.474279,-0.473408,-0.488580,1,0,0,0,1
3,1,1,0.407683,0.432550,-0.473408,0.420494,1,0,0,0,1
4,0,3,0.407683,-0.474279,-0.473408,-0.486064,0,1,0,0,1

In [16]:
df.to_csv('data/processed/titanicDataset_Final.csv', index=False)

### 6. Splitting dataset

In [17]:
X = df.drop(columns=['Survived'])
Y = df['Survived']

In [18]:
X_train, X_test, Y_train, Y_test = train_test_split(
                                                    X, Y,
                                                    test_size=0.2,
                                                    random_state=42
                                                    )

In [41]:
np.savez('artifacts/X_train.npz', X_train)
np.savez('artifacts/Y_train.npz', Y_train)
np.savez('artifacts/X_test.npz', X_test)
np.savez('artifacts/Y_test.npz', Y_test)

In [19]:
X_train

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
331,1,1.215251,-0.474279,-0.473408,-0.074541,0,1,0,0,1
733,2,-0.515250,-0.474279,-0.473408,-0.386454,0,1,0,0,1
382,3,0.176950,-0.474279,-0.473408,-0.488580,0,1,0,0,1
704,3,-0.284517,0.432550,-0.473408,-0.490005,0,1,0,0,1
813,3,-1.822740,3.153038,2.007806,-0.018699,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
106,3,-0.669073,-0.474279,-0.473408,-0.494114,1,0,0,0,1
270,1,0.000054,-0.474279,-0.473408,-0.024233,0,1,0,0,1
860,3,0.869150,1.339380,-0.473408,-0.364151,0,1,0,0,1
435,1,-1.207451,0.432550,2.007806,1.766749,1,0,0,0,1
102,1,-0.669073,-0.474279,0.767199,0.907228,0,1,0,0,1